; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
(define (problem transport-grid)
 (:domain transport)
 (:objects
 ;    A  B  C  D  E
 ; 1  A1 B1 ...
 ; 2  A2 B2 ...
 ; 3  ...
 ; 4
 ; 5
  A1 B1 C1 D1 E1 - location
  A2 B2 C2 D2 E2 - location
  A3 B3 C3 D3 E3 - location
  A4 B4 C4 D4 E4 - location
  A5 B5 C5 D5 E5 - location
  truck1 - vehicle
  p1 - package
  p2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; these are directed edges:
  (road A1 B1) (road B1 A1)
  (= (road-length A1 B1) 100)
  (= (road-length B1 A1) 100)
  (road A2 B2) (road B2 A2)
  (= (road-length A2 B2) 100)
  (= (road-length B2 A2) 100)
  (road A3 B3) (road B3 A3)
  (= (road-length A3 B3) 100)
  (= (road-length B3 A3) 100)
  (road A4 B4) (road B4 A4)
  (= (road-length A4 B4) 100)
  (= (road-length B4 A4) 100)
  (road A5 B5) (road B5 A5)
  (= (road-length A5 B5) 100)
  (= (road-length B5 A5) 100)
  (road B1 C1) (road C1 B1)
  (= (road-length B1 C1) 100)
  (= (road-length C1 B1) 100)
  (road B2 C2) (road C2 B2)
  (= (road-length B2 C2) 100)
  (= (road-length C2 B2) 100)
  (road B3 C3) (road C3 B3)
  (= (road-length B3 C3) 100)
  (= (road-length C3 B3) 100)
  (road B4 C4) (road C4 B4)
  (= (road-length B4 C4) 100)
  (= (road-length C4 B4) 100)
  (road B5 C5) (road C5 B5)
  (= (road-length B5 C5) 100)
  (= (road-length C5 B5) 100)
  (road C1 D1) (road D1 C1)
  (= (road-length C1 D1) 100)
  (= (road-length D1 C1) 100)
  (road C2 D2) (road D2 C2)
  (= (road-length C2 D2) 100)
  (= (road-length D2 C2) 100)
  (road C3 D3) (road D3 C3)
  (= (road-length C3 D3) 100)
  (= (road-length D3 C3) 100)
  (road C4 D4) (road D4 C4)
  (= (road-length C4 D4) 100)
  (= (road-length D4 C4) 100)
  (road C5 D5) (road D5 C5)
  (= (road-length C5 D5) 100)
  (= (road-length D5 C5) 100)
  (road D1 E1) (road E1 D1)
  (= (road-length D1 E1) 100)
  (= (road-length E1 D1) 100)
  (road D2 E2) (road E2 D2)
  (= (road-length D2 E2) 100)
  (= (road-length E2 D2) 100)
  (road D3 E3) (road E3 D3)
  (= (road-length D3 E3) 100)
  (= (road-length E3 D3) 100)
  (road D4 E4) (road E4 D4)
  (= (road-length D4 E4) 100)
  (= (road-length E4 D4) 100)
  (road D5 E5) (road E5 D5)
  (= (road-length D5 E5) 100)
  (= (road-length E5 D5) 100)
  (road A1 A2) (road A2 A1)
  (= (road-length A1 A2) 100)
  (= (road-length A2 A1) 100)
  (road A2 A3) (road A3 A2)
  (= (road-length A2 A3) 100)
  (= (road-length A3 A2) 100)
  (road A3 A4) (road A4 A3)
  (= (road-length A3 A4) 100)
  (= (road-length A4 A3) 100)
  (road A4 A5) (road A5 A4)
  (= (road-length A4 A5) 100)
  (= (road-length A5 A4) 100)
  (road B1 B2) (road B2 B1)
  (= (road-length B1 B2) 100)
  (= (road-length B2 B1) 100)
  (road B2 B3) (road B3 B2)
  (= (road-length B2 B3) 100)
  (= (road-length B3 B2) 100)
  (road B3 B4) (road B4 B3)
  (= (road-length B3 B4) 100)
  (= (road-length B4 B3) 100)
  (road B4 B5) (road B5 B4)
  (= (road-length B4 B5) 100)
  (= (road-length B5 B4) 100)
  (road C1 C2) (road C2 C1)
  (= (road-length C1 C2) 100)
  (= (road-length C2 C1) 100)
  (road C2 C3) (road C3 C2)
  (= (road-length C2 C3) 100)
  (= (road-length C3 C2) 100)
  (road C3 C4) (road C4 C3)
  (= (road-length C3 C4) 100)
  (= (road-length C4 C3) 100)
  (road C4 C5) (road C5 C4)
  (= (road-length C4 C5) 100)
  (= (road-length C5 C4) 100)
  (road D1 D2) (road D2 D1)
  (= (road-length D1 D2) 100)
  (= (road-length D2 D1) 100)
  (road D2 D3) (road D3 D2)
  (= (road-length D2 D3) 100)
  (= (road-length D3 D2) 100)
  (road D3 D4) (road D4 D3)
  (= (road-length D3 D4) 100)
  (= (road-length D4 D3) 100)
  (road D4 D5) (road D5 D4)
  (= (road-length D4 D5) 100)
  (= (road-length D5 D4) 100)
  (road E1 E2) (road E2 E1)
  (= (road-length E1 E2) 100)
  (= (road-length E2 E1) 100)
  (road E2 E3) (road E3 E2)
  (= (road-length E2 E3) 100)
  (= (road-length E3 E2) 100)
  (road E3 E4) (road E4 E3)
  (= (road-length E3 E4) 100)
  (= (road-length E4 E3) 100)
  (road E4 E5) (road E5 E4)
  (= (road-length E4 E5) 100)
  (= (road-length E5 E4) 100)
  (capacity truck1 capacity-4)

  (at p1 E4)
  (at p2 D5)
  (at truck1 E5)
)
 (:goal (and
  (at p1 B1)
  (at p2 A1)
))

 (:metric minimize (total-cost))
)

; plan
1. (drive truck1 e5 d5)
   deleted: (at truck1 e5)
   added: (at truck1 d5)
   goals met: 0 of 2
2. (pick-up truck1 d5 p2 capacity-3 capacity-4)
   deleted: (at p2 d5) (capacity truck1 capacity-4)
   added: (in p2 truck1) (capacity truck1 capacity-3)
   goals met: 0 of 2
3. (drive truck1 d5 d4)
   deleted: (at truck1 d5)
   added: (at truck1 d4)
   goals met: 0 of 2
4. (drive truck1 d4 e4)
   deleted: (at truck1 d4)
   added: (at truck1 e4)
   goals met: 0 of 2
5. (pick-up truck1 e4 p1 capacity-2 capacity-3)
   deleted: (at p1 e4) (capacity truck1 capacity-3)
   added: (in p1 truck1) (capacity truck1 capacity-2)
   goals met: 0 of 2
6. (drive truck1 e4 d4)
   deleted: (at truck1 e4)
   added: (at truck1 d4)
   goals met: 0 of 2
7. (drive truck1 d4 c4)
   deleted: (at truck1 d4)
   added: (at truck1 c4)
   goals met: 0 of 2
8. (drive truck1 c4 b4)
   deleted: (at truck1 c4)
   added: (at truck1 b4)
   goals met: 0 of 2
9. (drive truck1 b4 b3)
   deleted: (at truck1 b4)
   added: (at truck1 b3)
   goals met: 0 of 2
10. (drive truck1 b3 b2)
   deleted: (at truck1 b3)
   added: (at truck1 b2)
   goals met: 0 of 2
11. (drive truck1 b2 b1)
   deleted: (at truck1 b2)
   added: (at truck1 b1)
   goals met: 0 of 2
12. (drop truck1 b1 p1 capacity-2 capacity-3)
   deleted: (in p1 truck1) (capacity truck1 capacity-2)
   added: (at p1 b1) (capacity truck1 capacity-3)
   goals met: 1 of 2
13. (drive truck1 b1 a1)
   deleted: (at truck1 b1)
   added: (at truck1 a1)
   goals met: 1 of 2
14. (drop truck1 a1 p2 capacity-3 capacity-4)
   deleted: (in p2 truck1) (capacity truck1 capacity-3)
   added: (at p2 a1) (capacity truck1 capacity-4)
   goals met: 2 of 2
